SBenchmark Results with Plots

** make the plots and re-print the data

#+begin_src python :session :results output

  tables = [tbl_O0, tbl_Og, tbl_O1, tbl_O2, tbl_O3, tbl_Ofast]
  tnames = ["O0",   "Og",   "O1",   "O2",   "O3",   "Ofast"  ]

  dmap, oporder = gen_dmap(tables, tnames)

  # print(f"{oporder = !r}")
  # print(f"{dmap = !r}")

  print_relative_time(dmap, oporder, tnames, 'Og')
  print_relative_speed(dmap, oporder, tnames, 'Og')

  print_dmap(dmap, oporder, tnames, cols)

  # OPTIONAL: discard O0 and Og results from plot
  # tables = tables[2:]
  # tnames = tnames[2:]

  # OPTIONAL: discard O0 results from plot
  # tables = tables[1:]
  # tnames = tnames[1:]

  # OPTIONAL: discard "init with rand()" results from plot
  # oporder = [x for x in oporder if "init with rand" not in x]

  # Control the arrangement of the subplots.
  # For now, just lay them out in rows of five.
  # Later, we may want to have some specific
  # patterns in the op names that cause us to
  # break to the next row? Apply YAGNI for now.

  # can I put a lot of plots side-by-side?
  oprows = [oporder[0:10], oporder[10:]]

  plot_dmap(dmap, oprows, tnames, "benchmarks.png")

#+end_src

#+RESULTS:
#+begin_example

Time relative to Og (smaller is better):
| operation                        |       O0 |       Og |       O1 |       O2 |       O3 |    Ofast |
|----------------------------------|----------|----------|----------|----------|----------|----------|
| Mat init with rand()             |     1.30 |     1.00 |     0.26 |     0.29 |     0.26 |     0.24 |
| Mat = Mat                        |     1.08 |     1.00 |     0.94 |     0.90 |     0.90 |     0.90 |
| Mat += Mat                       |     3.18 |     1.00 |     0.54 |     0.29 |     0.29 |     0.30 |
| Mat -= Mat                       |     2.98 |     1.00 |     0.49 |     0.27 |     0.27 |     0.28 |
| Mat = Mat + Mat                  |     1.94 |     1.00 |     0.72 |     0.62 |     0.60 |     0.62 |
| Mat = Mat - Mat                  |     2.10 |     1.00 |     0.75 |     0.67 |     0.65 |     0.68 |
| Mat *= Num                       |     2.84 |     1.00 |     0.41 |     0.22 |     0.22 |     0.23 |
| Mat /= Num                       |     1.09 |     1.00 |     0.68 |     0.34 |     0.34 |     0.09 |
| RVec += RVec * Mat               |     3.16 |     1.00 |     0.79 |     0.40 |     0.40 |     0.41 |
| CVec += Mat * CVec               |     3.91 |     1.00 |     0.93 |     0.92 |     0.92 |     0.45 |
| Vec init with rand()             |     1.99 |     1.00 |     0.50 |     0.51 |     0.50 |     0.47 |
| Vec = Vec                        |     1.16 |     1.00 |     0.98 |     0.97 |     0.97 |     0.98 |
| Vec += Vec                       |     2.84 |     1.00 |     0.55 |     0.32 |     0.37 |     0.32 |
| Vec -= Vec                       |     2.55 |     1.00 |     0.56 |     0.36 |     0.38 |     0.32 |
| Vec = Vec + Vec                  |     2.00 |     1.00 |     0.81 |     0.75 |     0.83 |     0.72 |
| Vec = Vec - Vec                  |     1.95 |     1.00 |     0.78 |     0.74 |     0.74 |     0.68 |
| Vec *= Num                       |     2.33 |     1.00 |     0.46 |     0.24 |     0.24 |     0.24 |
| Vec /= Num                       |     1.17 |     1.00 |     0.99 |     0.50 |     0.50 |     0.12 |
| Num += Vec * Vec                 |     3.97 |     1.00 |     0.99 |     0.49 |     0.50 |     0.49 |

Speed relative to Og (larger is better):
| operation                        |       O0 |       Og |       O1 |       O2 |       O3 |    Ofast |
|----------------------------------|----------|----------|----------|----------|----------|----------|
| Mat init with rand()             |     0.77 |     1.00 |     3.82 |     3.46 |     3.88 |     4.17 |
| Mat = Mat                        |     0.93 |     1.00 |     1.06 |     1.11 |     1.11 |     1.11 |
| Mat += Mat                       |     0.31 |     1.00 |     1.85 |     3.41 |     3.46 |     3.35 |
| Mat -= Mat                       |     0.34 |     1.00 |     2.04 |     3.76 |     3.76 |     3.60 |
| Mat = Mat + Mat                  |     0.52 |     1.00 |     1.40 |     1.62 |     1.67 |     1.60 |
| Mat = Mat - Mat                  |     0.48 |     1.00 |     1.34 |     1.50 |     1.55 |     1.48 |
| Mat *= Num                       |     0.35 |     1.00 |     2.43 |     4.46 |     4.50 |     4.42 |
| Mat /= Num                       |     0.92 |     1.00 |     1.47 |     2.90 |     2.91 |    11.39 |
| RVec += RVec * Mat               |     0.32 |     1.00 |     1.27 |     2.53 |     2.52 |     2.46 |
| CVec += Mat * CVec               |     0.26 |     1.00 |     1.08 |     1.09 |     1.09 |     2.22 |
| Vec init with rand()             |     0.50 |     1.00 |     2.00 |     1.98 |     1.99 |     2.12 |
| Vec = Vec                        |     0.87 |     1.00 |     1.02 |     1.03 |     1.03 |     1.02 |
| Vec += Vec                       |     0.35 |     1.00 |     1.81 |     3.14 |     2.73 |     3.14 |
| Vec -= Vec                       |     0.39 |     1.00 |     1.78 |     2.74 |     2.65 |     3.08 |
| Vec = Vec + Vec                  |     0.50 |     1.00 |     1.24 |     1.32 |     1.21 |     1.38 |
| Vec = Vec - Vec                  |     0.51 |     1.00 |     1.28 |     1.35 |     1.36 |     1.47 |
| Vec *= Num                       |     0.43 |     1.00 |     2.17 |     4.08 |     4.12 |     4.08 |
| Vec /= Num                       |     0.86 |     1.00 |     1.01 |     2.02 |     2.00 |     8.18 |
| Num += Vec * Vec                 |     0.25 |     1.00 |     1.01 |     2.03 |     2.02 |     2.02 |

Nanoseconds per element for Mat init with rand():
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|   13.498 |   13.515 |   13.531 |   13.607 |   13.880 | O0       |
|   10.405 |   10.423 |   10.431 |   10.434 |   10.438 | Og       |
|    2.730 |    2.733 |    2.734 |    2.739 |    2.742 | O1       |
|    3.012 |    3.013 |    3.015 |    3.019 |    3.023 | O2       |
|    2.683 |    2.686 |    2.687 |    2.689 |    2.690 | O3       |
|    2.484 |    2.494 |    2.504 |    2.507 |    2.511 | Ofast    |

Nanoseconds per element for Mat = Mat:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    0.159 |    0.179 |    0.179 |    0.199 |    0.199 | O0       |
|    0.152 |    0.159 |    0.166 |    0.173 |    0.180 | Og       |
|    0.151 |    0.155 |    0.156 |    0.156 |    0.156 | O1       |
|    0.149 |    0.150 |    0.150 |    0.150 |    0.154 | O2       |
|    0.150 |    0.150 |    0.150 |    0.150 |    0.150 | O3       |
|    0.147 |    0.147 |    0.150 |    0.150 |    0.150 | Ofast    |

Nanoseconds per element for Mat += Mat:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    1.711 |    1.712 |    1.712 |    1.720 |    1.732 | O0       |
|    0.525 |    0.532 |    0.539 |    0.539 |    0.553 | Og       |
|    0.287 |    0.289 |    0.291 |    0.295 |    0.295 | O1       |
|    0.154 |    0.158 |    0.158 |    0.158 |    0.162 | O2       |
|    0.154 |    0.154 |    0.156 |    0.158 |    0.158 | O3       |
|    0.154 |    0.157 |    0.161 |    0.163 |    0.179 | Ofast    |

Nanoseconds per element for Mat -= Mat:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    1.771 |    1.771 |    1.772 |    1.772 |    1.791 | O0       |
|    0.580 |    0.581 |    0.594 |    0.594 |    0.594 | Og       |
|    0.287 |    0.291 |    0.291 |    0.293 |    0.295 | O1       |
|    0.158 |    0.158 |    0.158 |    0.162 |    0.162 | O2       |
|    0.158 |    0.158 |    0.158 |    0.158 |    0.158 | O3       |
|    0.161 |    0.161 |    0.165 |    0.165 |    0.182 | Ofast    |

Nanoseconds per element for Mat = Mat + Mat:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    1.970 |    2.009 |    2.010 |    2.029 |    2.050 | O0       |
|    1.036 |    1.036 |    1.036 |    1.050 |    1.089 | Og       |
|    0.695 |    0.724 |    0.741 |    0.741 |    0.749 | O1       |
|    0.627 |    0.633 |    0.639 |    0.648 |    0.652 | O2       |
|    0.608 |    0.619 |    0.622 |    0.632 |    0.651 | O3       |
|    0.576 |    0.615 |    0.647 |    0.659 |    0.679 | Ofast    |

Nanoseconds per element for Mat = Mat - Mat:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    1.987 |    1.990 |    2.030 |    2.030 |    2.030 | O0       |
|    0.964 |    0.966 |    0.967 |    0.987 |    1.008 | Og       |
|    0.716 |    0.722 |    0.724 |    0.739 |    0.758 | O1       |
|    0.593 |    0.639 |    0.644 |    0.663 |    0.686 | O2       |
|    0.611 |    0.621 |    0.625 |    0.630 |    0.651 | O3       |
|    0.565 |    0.613 |    0.654 |    0.657 |    0.690 | Ofast    |

Nanoseconds per element for Mat *= Num:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    1.552 |    1.562 |    1.572 |    1.572 |    1.573 | O0       |
|    0.539 |    0.551 |    0.553 |    0.553 |    0.567 | Og       |
|    0.228 |    0.228 |    0.228 |    0.230 |    0.232 | O1       |
|    0.120 |    0.120 |    0.124 |    0.124 |    0.124 | O2       |
|    0.120 |    0.121 |    0.123 |    0.123 |    0.123 | O3       |
|    0.122 |    0.122 |    0.125 |    0.136 |    0.140 | Ofast    |

Nanoseconds per element for Mat /= Num:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    1.532 |    1.552 |    1.553 |    1.572 |    1.573 | O0       |
|    1.423 |    1.424 |    1.424 |    1.431 |    1.438 | Og       |
|    0.966 |    0.968 |    0.970 |    0.970 |    0.970 | O1       |
|    0.487 |    0.489 |    0.491 |    0.491 |    0.491 | O2       |
|    0.490 |    0.490 |    0.490 |    0.490 |    0.490 | O3       |
|    0.122 |    0.122 |    0.125 |    0.134 |    0.136 | Ofast    |

Nanoseconds per element for RVec += RVec * Mat:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    2.666 |    2.667 |    2.667 |    2.667 |    2.668 | O0       |
|    0.829 |    0.830 |    0.843 |    0.843 |    0.843 | Og       |
|    0.662 |    0.662 |    0.662 |    0.662 |    0.662 | O1       |
|    0.333 |    0.333 |    0.333 |    0.333 |    0.338 | O2       |
|    0.332 |    0.332 |    0.334 |    0.336 |    0.336 | O3       |
|    0.333 |    0.340 |    0.343 |    0.343 |    0.344 | Ofast    |

Nanoseconds per element for CVec += Mat * CVec:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    2.627 |    2.634 |    2.647 |    2.648 |    2.648 | O0       |
|    0.677 |    0.677 |    0.677 |    0.684 |    0.691 | Og       |
|    0.628 |    0.628 |    0.628 |    0.628 |    0.632 | O1       |
|    0.619 |    0.619 |    0.620 |    0.622 |    0.624 | O2       |
|    0.621 |    0.621 |    0.621 |    0.624 |    0.625 | O3       |
|    0.304 |    0.304 |    0.305 |    0.308 |    0.311 | Ofast    |

Nanoseconds per element for Vec init with rand():
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|   20.925 |   20.935 |   20.959 |   20.995 |   21.122 | O0       |
|   10.499 |   10.527 |   10.555 |   10.566 |   10.614 | Og       |
|    5.257 |    5.267 |    5.276 |    5.277 |    5.279 | O1       |
|    5.333 |    5.337 |    5.342 |    5.345 |    5.347 | O2       |
|    5.287 |    5.292 |    5.298 |    5.308 |    5.317 | O3       |
|    4.969 |    4.972 |    4.977 |    4.979 |    4.982 | Ofast    |

Nanoseconds per element for Vec = Vec:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    0.163 |    0.178 |    0.178 |    0.178 |    0.193 | O0       |
|    0.154 |    0.154 |    0.154 |    0.154 |    0.161 | Og       |
|    0.147 |    0.149 |    0.151 |    0.151 |    0.155 | O1       |
|    0.146 |    0.147 |    0.150 |    0.150 |    0.154 | O2       |
|    0.148 |    0.149 |    0.150 |    0.152 |    0.156 | O3       |
|    0.148 |    0.151 |    0.151 |    0.153 |    0.154 | Ofast    |

Nanoseconds per element for Vec += Vec:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    1.411 |    1.411 |    1.411 |    1.426 |    1.426 | O0       |
|    0.483 |    0.490 |    0.496 |    0.497 |    0.497 | Og       |
|    0.273 |    0.274 |    0.274 |    0.276 |    0.278 | O1       |
|    0.154 |    0.156 |    0.158 |    0.172 |    0.185 | O2       |
|    0.171 |    0.179 |    0.182 |    0.193 |    0.200 | O3       |
|    0.158 |    0.158 |    0.158 |    0.161 |    0.165 | Ofast    |

Nanoseconds per element for Vec -= Vec:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    1.262 |    1.262 |    1.263 |    1.277 |    1.278 | O0       |
|    0.490 |    0.490 |    0.496 |    0.497 |    0.504 | Og       |
|    0.277 |    0.278 |    0.278 |    0.278 |    0.278 | O1       |
|    0.169 |    0.174 |    0.181 |    0.185 |    0.185 | O2       |
|    0.175 |    0.186 |    0.187 |    0.192 |    0.193 | O3       |
|    0.158 |    0.161 |    0.161 |    0.161 |    0.165 | Ofast    |

Nanoseconds per element for Vec = Vec + Vec:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    1.737 |    1.745 |    1.753 |    1.767 |    1.767 | O0       |
|    0.840 |    0.859 |    0.877 |    0.906 |    0.913 | Og       |
|    0.689 |    0.699 |    0.709 |    0.720 |    0.725 | O1       |
|    0.639 |    0.643 |    0.662 |    0.668 |    0.689 | O2       |
|    0.641 |    0.702 |    0.727 |    0.759 |    0.775 | O3       |
|    0.606 |    0.615 |    0.634 |    0.642 |    0.658 | Ofast    |

Nanoseconds per element for Vec = Vec - Vec:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    1.753 |    1.760 |    1.767 |    1.780 |    1.825 | O0       |
|    0.826 |    0.848 |    0.906 |    0.913 |    0.921 | Og       |
|    0.676 |    0.697 |    0.708 |    0.713 |    0.764 | O1       |
|    0.643 |    0.658 |    0.670 |    0.697 |    0.715 | O2       |
|    0.641 |    0.665 |    0.667 |    0.667 |    0.678 | O3       |
|    0.593 |    0.612 |    0.617 |    0.625 |    0.644 | Ofast    |

Nanoseconds per element for Vec *= Num:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    1.126 |    1.135 |    1.143 |    1.143 |    1.144 | O0       |
|    0.483 |    0.490 |    0.490 |    0.494 |    0.498 | Og       |
|    0.222 |    0.226 |    0.226 |    0.228 |    0.230 | O1       |
|    0.116 |    0.118 |    0.120 |    0.120 |    0.120 | O2       |
|    0.119 |    0.119 |    0.119 |    0.119 |    0.123 | O3       |
|    0.120 |    0.120 |    0.120 |    0.120 |    0.120 | Ofast    |

Nanoseconds per element for Vec /= Num:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    1.129 |    1.136 |    1.144 |    1.144 |    1.158 | O0       |
|    0.980 |    0.980 |    0.981 |    0.981 |    0.988 | Og       |
|    0.967 |    0.968 |    0.971 |    0.971 |    0.971 | O1       |
|    0.486 |    0.486 |    0.486 |    0.490 |    0.490 | O2       |
|    0.486 |    0.490 |    0.490 |    0.490 |    0.494 | O3       |
|    0.120 |    0.120 |    0.120 |    0.120 |    0.120 | Ofast    |

Nanoseconds per element for Num += Vec * Vec:
| min      | 25%      | 50%      | 75%      | max      |          |
|----------|----------|----------|----------|----------|----------|
|    2.613 |    2.614 |    2.615 |    2.615 |    2.615 | O0       |
|    0.658 |    0.658 |    0.659 |    0.662 |    0.666 | Og       |
|    0.646 |    0.650 |    0.650 |    0.650 |    0.650 | O1       |
|    0.324 |    0.324 |    0.324 |    0.328 |    0.328 | O2       |
|    0.323 |    0.326 |    0.327 |    0.327 |    0.327 | O3       |
|    0.326 |    0.326 |    0.326 |    0.329 |    0.329 | Ofast    |
#+end_example

